sancho_ws/src/sancho_web_assistant/test/load_test/breakpoint.txt
  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<=0.01' rate=80.66%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration.......................................................: avg=6.1s   min=0s      med=0s       max=32.71s p(90)=31.4s  p(95)=31.82s
      { expected_response:true }............................................: avg=31.58s min=31.13s  med=31.43s   max=32.71s p(90)=32.28s p(95)=32.51s
    http_req_failed.........................................................: 80.66% 1969 out of 2441
    http_reqs...............................................................: 2441   66.866063/s

    EXECUTION
    dropped_iterations......................................................: 77326  2118.183206/s
    iteration_duration......................................................: avg=8.6s   min=10.28ms med=221.92ms max=32.95s p(90)=31.61s p(95)=31.97s
    iterations..............................................................: 1760   48.2115/s
    vus.....................................................................: 28140  min=41           max=28140
    vus_max.................................................................: 28140  min=42           max=28140

    NETWORK
    data_received...........................................................: 114 MB 3.1 MB/s
    data_sent...............................................................: 830 kB 23 kB/s



running (00m36.5s), 00000000/00028993 VUs, 1678 complete and 28993 interrupted iterations
breakpoint ✗ [=>------------------------------------] 00028920/00028993 VUs  00m36.2s/10m0s  005999.92 iters/s
ERRO[0036] thresholds on metrics 'http_req_failed' were crossed; at least one has abortOnFail enabled, stopping test prematurely