sancho_ws/src/sancho_web_assistant/test/load_test/spike.txt

  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<=0.05' rate=28.41%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration.......................................................: avg=34.28s min=0s      med=37.63s max=1m0s   p(90)=58.94s p(95)=1m0s  
      { expected_response:true }............................................: avg=33.61s min=9.99ms  med=37.61s max=59.83s p(90)=54.67s p(95)=54.71s
    http_req_failed.........................................................: 28.41% 6011 out of 21155
    http_reqs...............................................................: 21155  147.357972/s

    EXECUTION
    iteration_duration......................................................: avg=37.98s min=10.32ms med=37.63s max=1m0s   p(90)=1m0s   p(95)=1m0s  
    iterations..............................................................: 21155  147.357972/s
    vus.....................................................................: 29     min=29            max=11597
    vus_max.................................................................: 11597  min=11597         max=11597

    NETWORK
    data_received...........................................................: 3.6 GB 25 MB/s
    data_sent...............................................................: 2.4 MB 17 kB/s



running (2m23.6s), 00000/11597 VUs, 21155 complete and 2485 interrupted iterations
default ✓ [======================================] 00000/11597 VUs  2m0s
ERRO[0143] thresholds on metrics 'http_req_failed' have been crossed