sancho_ws/src/sancho_web_assistant/test/load_test/stress.txt
 tfg-client  ubuntu   main  …  sancho_web_assistant  test  load_test  99  K6_WEB_DASHBOARD=true k6 run api-get-faceprints-stress.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: api-get-faceprints-stress.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 23194 max VUs, 8m30s max duration (incl. graceful stop):
              * default: Up to 23194 looping VUs for 8m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✗ 'avg <= 5000' avg=36.97s

    http_req_failed
    ✓ 'rate <= 0.01' rate=0.00%


  █ TOTAL RESULTS 

    HTTP
    http_req_duration.......................................................: avg=36.97s min=36.91s med=36.96s max=36.99s p(90)=36.98s p(95)=36.98s
      { expected_response:true }............................................: avg=36.97s min=36.91s med=36.96s max=36.99s p(90)=36.98s p(95)=36.98s
    http_req_failed.........................................................: 0.00%  0 out of 83
    http_reqs...............................................................: 83     2.205222/s

    EXECUTION
    iteration_duration......................................................: avg=36.97s min=36.91s med=36.96s max=36.99s p(90)=36.98s p(95)=36.98s
    iterations..............................................................: 83     2.205222/s
    vus.....................................................................: 4846   min=79      max=4846 
    vus_max.................................................................: 23194  min=23194   max=23194

    NETWORK
    data_received...........................................................: 20 MB  531 kB/s
    data_sent...............................................................: 557 kB 15 kB/s



running (0m37.6s), 00000/23194 VUs, 83 complete and 4846 interrupted iterations
default ✗ [=>------------------------------------] 00011/23194 VUs  0m37.6s/8m00.0s
ERRO[0038] thresholds on metrics 'http_req_duration' were crossed; at least one has abortOnFail enabled, stopping test prematurely